[
{
    "job_id": "e289d015-f60d-48da-8392-23eec0ad6bdd",
    "role": "Java Spring Developers (RESTful APIs, Microservices), eCommerce, Midlands",
    "company": "Staffworx Limited",
    "rate": "excellent salary, full Benefits",
    "description": "Java Developer, Software Engineer. Market leader looking for experienced Java Developers to work in design and development of new headless commerce eCommerce platform build in agile CI/CD Java Microservices Cloud based architecture. Working in market leading Java spring, API and E-commerce platform, you will have good understanding of integration of Java systems, solid clean coding skills and a good appreciation of Java, Spring and APIs. M ain Responsibilities Development Strategy Good Design Principals Good Coding Principals Mentoring Responsibilities Integration to New & Legacy Systems...  more ->",
    "link": "http://www.jobserve.com/HBn9T",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "089433cb-ef27-45e1-95bd-5208de47a68d",
    "role": "Java Developers, join the world's leading E-commerce development team",
    "company": "Staffworx Limited",
    "rate": "excellent salary, bonus, full Benefits",
    "description": "Java developer, E-commerce. Market leading omni-channel commerce provider looking to expand his team of elite software engineers and E-commerce professionals working in Central London with many of the world's leading consumer brands. full agile advocacy, state of the art tech and cloud based solutions, you will join one of the top E-commerce development teams in Europe, if not the world. Java Spring Developer, stage of the art eCommerce software solutions, micro-services, APIs, SOA and omni-channel commerce. You will be working as part of a dynamic Java development team in a microservices or...  more ->",
    "link": "http://www.jobserve.com/G9wai",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "5494aa27-83cc-4b78-ae50-932c276c80da",
    "role": "Java Developer",
    "company": "McGregor Boyall",
    "rate": "£40k - £55k per annum + benefits+remote working options",
    "description": "Java Developer- Manchester This is a fantastic opportunity to join industry leading company that is looking for Java developers on all levels to join their growing team in Manchester. This is a chance to join well established and rapidly growing business that is present in more than 20 countries in the world, work with modern technologies in a supportive, collaborative and friendly work environment. The role will be in their well-advanced technology hub in Manchester that is based very close to Metrolink station and you will be joining a successful team and will be helping with delivery of...  more ->",
    "link": "http://www.jobserve.com/HDHsB",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "bd32f4ef-81c8-428d-b631-34e75d44ea03",
    "role": "Java Software Engineer",
    "company": "McGregor Boyall",
    "rate": "£45k - £65k per annum + benefits+remote working options",
    "description": "Java Developer This is a fantastic opportunity to join well established and globally recognised company based in Manchester. Company is an award-winning business that is due to growth looking for Java developers to join their team and work on their next exciting projects. You will be joining this-projects from the start so this is a fantastic opportunity to deliver something exciting from the start. This will also give you strong opporutnity for progression into more Senior positions in the future. This is an opportunity to join forward thinking organisation, work with moder technologies next...  more ->",
    "link": "http://www.jobserve.com/HDHr3",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "3d85c030-f3ee-46e2-b0a5-4f0f5735e0c0",
    "role": "Java Developers, join the world's leading E-commerce development team",
    "company": "Staffworx Limited",
    "rate": "excellent salary, bonus, full Benefits",
    "description": "Java developer, E-commerce. Market leading omni-channel commerce provider looking to expand his team of elite software engineers and E-commerce professionals working in Central London with many of the world's leading consumer brands. full agile advocacy, state of the art tech and cloud based solutions, you will join one of the top E-commerce development teams in Europe, if not the world. Java Spring Developer, stage of the art eCommerce software solutions, micro-services, APIs, SOA and omni-channel commerce. You will be working as part of a dynamic Java development team in a microservices or...  more ->",
    "link": "http://www.jobserve.com/G5Lnm",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "78810577-7a5d-4eb6-86d1-474e3f4b15a6",
    "role": "Java Tech Lead",
    "company": "Harvey Nash Plc",
    "rate": "£70k-£80k per annum",
    "description": "Java Tech Lead Manchester City Center Up to £80,000 One of the fastest growing digital organisations in the UK are looking for a Java Tech Lead to join their thriving technical team based in Central Manchester and help them deliver superb software in support of their continued growth. The organisation have gone through sustained periods of growth, and are about to embark on some major software development projects. The client is London based but is starting to move their technology up to Manchester and they need a tech lead to oversee the first squad of 8 developers moving up. 3 more squads...  more ->",
    "link": "http://www.jobserve.com/HDLIs",
    "posted": "20190627",
    "relevance": 1
},{
    "job_id": "f53bce10-7510-4ab6-af7f-74716d7928e7",
    "role": "Java Technical Lead - VP",
    "company": "McGregor Boyall",
    "rate": "£80k per annum",
    "description": "Java Technical Lead - VP McGregor Boyall has an exciting opportunity for an experienced Java Technical Lead to join a growing financial services organization at the forefront of technology innovation on a permanent basis. This institution is renowned worldwide and known in the market for their extremely high calibre of technical teams. You will be brought in to lead a new team in Glasgow with a small team of three initially but with scope to grow exponentially. You will lead the strategical direction of your team and the solution you are building and will remain hands-on, spending around 50%...  more ->",
    "link": "http://www.jobserve.com/HCidL",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "b2065ee6-3f92-4cda-b9b5-17608e70780b",
    "role": "Java Developer - Agile -TDD - £45,000 - London Bridge",
    "company": "Harvey Nash IT Recruitment UK",
    "rate": "£35k - £45k per annum",
    "description": "Java Developer - Agile - £45k - London Bridge. Are you a talented Java developer looking to work for one of the UK's largest booksellers? You will be part of their huge growth plans for the 2019, working on their new E-commerce platform. Although the business is over 100 years old, you will be working in the Development team which is still in start up phase. Working in close proximity to the Tech Lead and alongside another three Java Developers you will have a chance to develop existing skills and learn new ones. Key Responsibilities: Develop new features to existing web application...  more ->",
    "link": "http://www.jobserve.com/HC1bw",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "b1c77271-2b01-42bd-9e15-ec86b782b758",
    "role": "Java Developer Quant Trading - Machine Learning - £80k-£120k",
    "company": "McGregor Boyall",
    "rate": "£80k - £120k per annum + bonus",
    "description": "Java Developer Quant Trading - Machine Learning - £80k-£120k A strong core Java developer is required to join a market leading Quant Trading technology team in London. The team leverage the use of the latest data science functions and as a result it provides great exposure to machine learning technology. There is also extensive exposure to Traders, Quants and Sales teams and provide a great platform to develop your quant research skills. You will also be expected to keep up to date with the latest developments within the Java world and also enhance their business/product knowledge. The...  more ->",
    "link": "http://www.jobserve.com/HC4Gc",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "9af36814-1463-42dc-8b2b-b2155d38e249",
    "role": "Java Developer",
    "company": "Whitehall Resources Ltd",
    "rate": "£Market",
    "description": "Java Developer Whitehall Resources are currently looking for a Java Developer Key Requirements: - Expert knowledge and experience with CI/CD and source code control. - Expert knowledge in gitflow. - Expert knowledge in unit test, static code analysis. - Good knowledge of Junit, Jmeter, Jenkins. - Boot strap, Angular, Javascript, JQUERY, Junit, Hibernate. - Experience in integration of QA automation tools. - Node.js. - Hapi framework. - React. - Azure cloud services. - Database knowledge - including code first approach. - GDS experience (desirable). - Experience in integration with 3rd party...  more ->",
    "link": "http://www.jobserve.com/HC3bt",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "f9a9b8af-b339-4eab-8477-b873027aa88f",
    "role": "Java Software Engineers, Multiple - Greenfield Digital Banking",
    "company": "McGregor Boyall",
    "rate": "£50k - £135k per annum + bonus",
    "description": "Java Software Engineers. Multiple - Greenfield Digital Banking - Fintech - Open Salary A leading financial services organisation are undertaking ambitious growth plans in 2019 by developing a greenfield digital banking platform in London. They require multiple Java software engineers, with strong experience of; Real Time system, multi-threading and distributed systems, at a range of experience levels to join this initiative. The environment is typical of a fintech, with great levels of creativity and autonomy required, in order to best utilise this greenfield digital banking platform. Given...  more ->",
    "link": "http://www.jobserve.com/HC4Ge",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "eb88a2a0-4bf6-42e3-b0d7-34830354896d",
    "role": "Java Algo Developer - Algo execution - Investment Bank",
    "company": "Adlam Consulting Ltd",
    "rate": "up to £800 per Day",
    "description": "Java Algo Developer - Algo execution - Investment Bank Java Front Office trading Java developer is required who will have experience of high frequency, low latency enterprise programming environments. e-Trading, not necessarily pricing/algo specifically (although it would be good, particularly execution algos), but must have a general knowledge of venues/products/mechanics, ideally in FI Rates. previous experience of dealing with Front Office (ie trading/Quants) core Java/multi-threading/performance/concurrency self-starter the role has dual reporting lines into IT and Quants so the candidate...  more ->",
    "link": "http://www.jobserve.com/HBOHY",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "5a3b835f-f4de-46d1-bdf4-d6330426e680",
    "role": "Java Developer",
    "company": "Harvey Nash IT Recruitment UK",
    "rate": "Up to £428 Per Day",
    "description": "Java Developer, contract for 6 months based in London, up to £428/day! For my Client, an international company from automotive sector, I am currently looking for an Java Developer! Key requirements:. Java/J2EE. Pairing Programming. Azure. Spring, Spring Boot. Pivotal Cloud Foundry. Gradle It is key that a successful candidate has experience in Pairing Programming. If you have the above experience and expertise, please apply ASAP as this job may be perfect for you! more ->",
    "link": "http://www.jobserve.com/HDLjo",
    "posted": "20190627",
    "relevance": 1
},{
    "job_id": "1b5f5d95-345f-4be3-a3f6-3b23f20e2deb",
    "role": "Java Developer",
    "company": "CPS Group (UK) Ltd",
    "rate": "£400 - £425 per day",
    "description": "Java Developer - Cardiff We are currently recruiting for a well established Fintech organisation based in South Wales, they are looking for a talented Java Developer to join them on an initial 3 Month contract basis. The key skills for this position are as follows:.Java 7/8.Spring Framework (Boot, MVC, Security).Hibernate/JPA.Apache Camel.Webservices SOAP, REST, JSON, XML.Maven.Junit For more information on the role, or for a confidential chat, please contact Jacob Bloom. By applying to this advert you are giving CPS Group (UK) Ltd authority to hold and process your data for this specific...  more ->",
    "link": "http://www.jobserve.com/HCgNU",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "73fa60f8-b361-49d9-82db-ade88e32d2d7",
    "role": "Java (8) Trading Systems Developer Spring Hibernate SQL - Agile - Investment Bank",
    "company": "Adlam Consulting Ltd",
    "rate": "£550 - £675 per Day",
    "description": "Java (8) Trading Systems Developer Spring Hibernate SQL - Agile - Investment Bank Strong technical Java (8) developer is required who has worked in similar enterprise environments. Investment Banking is essential! You must also have experience of the following Experience of Spring, Hibernate and or similar web frameworks Knowledge of SQL Worked in a similar enterprise environment Proven experience in technology, especially with the analysis, design, development and implementation of complex, PnL critical systems Several years software development experience, within an investment banking...  more ->",
    "link": "http://www.jobserve.com/G9aIk",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "7db3ae6f-26c7-44f0-abec-7c87a348562e",
    "role": "Java Developer - Backend - Healthcare - London - Asap",
    "company": "Sparta Global",
    "rate": "£450 - £550 per Day",
    "description": "Java Developer - Backend - London - Healthcare - 6 months - Asap Overview A leading Healthcare organisation is looking for a experienced Java Back End Developer to help develop an in-house system. The main language is Java and the Developer will be required to work with a multi-disciplinary team including Scrum Masters, Product Owners, Testing and other Developers. The team is a friendly team who value all input and you will have some option to work from home for 1 Day per week, with more on agreement. You will be developing, deploying and ensuring the integrity of a microservice to transfer...  more ->",
    "link": "http://www.jobserve.com/HCjep",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "7680fa89-4629-4e89-8367-0c9de3dc9fd5",
    "role": "Java Developer - Java 8, React, AWS, Kubernetes, Docker, Pair programming",
    "company": "Bentley Whitaker Search & Selection",
    "rate": "£55- £85k + 5k car allowance,bonus,Pension",
    "description": "Java Developer (Intermediate & Senior) - Java 8, React, AWS, Kubernates, Docker, Pair programming - Multiple roles Description for the Java Developer roles:- Rapidly expanding well known mobile market disrupter seek a number of Developers from intermediate to Senior Level to join what is regarded as one of the most sought after company on the market, with a fantastic reputation. Our client are looking for Fullstack, Back End and Front End developers, their core stack been Java 8 and React. The key is someone who really enjoys working in a collaborative way with the desire to pick up new...  more ->",
    "link": "http://www.jobserve.com/HCVF7",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "517be8d4-7c11-4f9e-9eb3-43211ee0db94",
    "role": "Java Spring Developer, headless commerce, API microservices, London",
    "company": "Staffworx Limited",
    "rate": "£60k-£80k base + bonus, full benefits",
    "description": "Java Spring Developer, software engineering specialist in Java, ideally with some experience in REST APIs, microservices or Kolin for leading E-commerce environments. Working on cutting edge API solutions that allow customers to integrate E-commerce into their products, services, and websites in unique and cutting-edge ways. Implementing microservices for the future of commerce. Join a company with a rich heritage of developing commerce solutions for some of the world's leading eCommerce and consumer products companies. We are seeking experienced Java based software engineers to help us...  more ->",
    "link": "http://www.jobserve.com/Gw1m2",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "f3bd5d5b-b732-4937-ae61-89d5849e0a7a",
    "role": "Java Developer",
    "company": "Java Source",
    "rate": "£50k - 55k per annum, Benefits: Bonus +",
    "description": "Java Developer Salary: Up to £55K + 10% Bonus + Full Benefits Package Location: Newbury (Excellent commute from Reading, South Oxford, Swindon, Basingstoke, etc) We are looking for creative, problem solvers who can help us develop new features using Java code. You will have a real passion for programming & software development, but don't want to just cut-code from a specification - you'll want to be part of the whole software development life cycle, making positive contributions to the Agile projects you are working on. We can provide an excellent, collaborative environment where everyone...  more ->",
    "link": "http://www.jobserve.com/HDLFp",
    "posted": "20190627",
    "relevance": 1
},{
    "job_id": "694edc20-acd8-4a60-ae8b-06ae308bb1a7",
    "role": "Java Developer",
    "company": "Java Source",
    "rate": "£35k-£65k per annum",
    "description": "Java Developer, Senior Java Developer, Java Software Engineer, Java Web Developer, Spring, Hibernate, API, JPA, CMS, WCM, AWS, NoSQL, MySQL, Jenkins, Git, Linux, London Agile Java Developer required to join a high performing team, focussed on building Low latency trading systems. Probably around 2+ years' experience, although not set. It's an excellent Java Development environment, where we try to be as Agile as we can - modern CI/CD in place & we work in a lot of open source Java tools, frameworks & platforms to build great software products. We also have fun doing it. Environment, culture &...  more ->",
    "link": "http://www.jobserve.com/HC3Zn",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "c3751360-99cb-4a39-89c7-0cc1b06548db",
    "role": "Java Developer",
    "company": "Java Source",
    "rate": "£50k-£55k per annum, Benefits: Bonus +",
    "description": "Java Developer Salary: Up to £55K + 10% Bonus + Full Benefits Package Location: Newbury (Excellent commute from Reading, South Oxford, Swindon, Basingstoke) We are looking for creative, problem solvers who can help us develop new features using Java code. You will have a real passion for programming & software development, but don't want to just cut-code from a specification - you'll want to be part of the whole software development life cycle, making positive contributions to the Agile projects you are working on. We can provide an excellent, collaborative environment where everyone (from...  more ->",
    "link": "http://www.jobserve.com/HCiKe",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "e2e8678c-2e2d-4cb3-8eab-7db9ee5f4420",
    "role": "Java | Node Developer",
    "company": "Square One Resources",
    "rate": "£450-£495 Per Day",
    "description": "Java | Node Developer Newcastle Circa £495 per day 6 months initially Java | Node developer is required for a 6 month contract based in Newcastle. The role is working for a prestigious client and will need commercial experience of Node.js.. Node.js. Hapi framework. React. Azure cloud services. Database knowledge - including code first approach. Expert knowledge and experience with CI/CD and source code control. Expert knowledge in gitflow. Expert knowledge in unit test, static code analysis. Good knowledge of Junit, Jmeter, Jenkins. GDS experience (desirable). Experience in integration with...  more ->",
    "link": "http://www.jobserve.com/HC3cG",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "35f17280-f75a-46ee-956d-6350ca6c8202",
    "role": "Java Developer",
    "company": "Square One Resources",
    "rate": "£400-£425 Per Day",
    "description": "Java Developer | REST API's | Spring Boot | Swagger Location: Surrey Pay rate: £400-£425/day Duration: 3 months initially A Java Developer is required to join an exciting 3 month initial contract working for a global financial services client based in Surrey. Outline Of Project The end client are intergrating API's into their current Back End systems and need a Java Developer with the below skills. Key skills required - Java/J2EE - RESTAPI's - Spring Boot - Swagger - MVC Framework Desirable skills - PCF If you are interested in this opportunity, please apply now with your updated CV in...  more ->",
    "link": "http://www.jobserve.com/HDHel",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "e0072945-6b29-4319-a676-82fe06a3cc7e",
    "role": "Java Developer",
    "company": "Square One Resources",
    "rate": "£450.00 - £500.00 per Day",
    "description": "Java Developer | Central London | 3 months initially Day rate - £500 a day Location - Central London Length of contract - 3 Month initial + likely extension Java Developer is required by an Educational institute based in Central London. Summary Of Role Back End Java Developer using open source and cloud technologies such as: Java 8 Azure cloud hosting Appreciation of APIs and complex systems integrations Standards such as REST, gRPC, GraphQL, Thrift and/or JSON-RPC and older alternatives of file transfers Source Control: GitHub Working 'Agile' (using Scrum) in a pair programming environment...  more ->",
    "link": "http://www.jobserve.com/HCfip",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "463a4080-c896-402a-aac8-b06e89179e51",
    "role": "Java Developer",
    "company": "Cooper Lomaz Recruitment Limited",
    "rate": "£45k per year",
    "description": "Java Developer South Cambridge Permanent Salary £45k+ This is a new opportunity for a Java/Scala Developer to join an independent and well established Cambridge Software Company as part of their expanding team, working with clients across the globe in the development and delivery of bespoke software solutions. As the Java/Scala Developer, you will be a key contributor to the team, generating ECM software and included in the entire product life cycle. Role: Full stack F2B Software design CI/New Technologies/Frameworks E2E journey Technical qualities: Java/JavaScript/Scala Spring/CDI/SQL/EJB...  more ->",
    "link": "http://www.jobserve.com/HDGpb",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "e07a17db-f4bb-4c16-9efe-aab8ed87bc19",
    "role": "Java Developer",
    "company": "Triad Resourcing",
    "rate": "Up to £70k per annum",
    "description": "Java Developer Brief Overview We are seeking an experienced Java Developer. Triads client is one of the biggest UK web brands. Online web activity levels are only exceeded by the likes of eBay, Facebook and Amazon. You will be delivering world class technology to millions of end users. You will be smart, passionate and motivated to deliver great websites. Due to the fast-paced environment, you must be confident and a quick learner. You must have a curious nature and go out of your way to understand. Take control and make things that matter count. Make complex things simple. Do the right thing...  more ->",
    "link": "http://www.jobserve.com/HC8fY",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "c9dc43ce-27c9-441e-b064-e87166c84b3d",
    "role": "Java Developer - Up to £75k",
    "company": "James Chase Solutions",
    "rate": "Up to £75k",
    "description": "Java Developer | Brighton | Up to £75,000 How would you like to see your work used by 10,000s of customers, stretching across 4 different continents? Do you want to be part of a disruptive, high growth, insurtech start-up who after less than 2 years of trading have already entered a partnership with a global monopoly in the automotive industry? If you think this is impressive, you should hear their plans for pushing even more boundaries Day to day you'll be making an impact on what is already an outstanding web and mobile application, with new features planned and other improvements already...  more ->",
    "link": "http://www.jobserve.com/HCQWk",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "dd2f5b07-fafc-4782-a4c9-800736f01f4e",
    "role": "Java Developer Software Engineer Finance Trading AWS London",
    "company": "Joseph Harry Ltd",
    "rate": "£80k - £100k per annum + 20% Bonus + 10% Pension",
    "description": "Java Developer (J2EE Programmer Software Engineer Amazon Web Services AWS Finance Trading PostgreSQL MySQL gRPC Aurora Dropwizard Microservices) required by our asset management client in London. You MUST have the following: Advanced experience as a Java Developer/Programmer/Software Engineer, including microservices Java service to service API experience PostgreSQL or MySQL Experience working with Amazon Web Services (AWS) OR financial trading data The following is DESIRABLE, not essential: gRPC Amazon Aurora Dropwizard Role: Java Developer (J2EE Programmer Software Engineer Amazon Web...  more ->",
    "link": "http://www.jobserve.com/HDHrF",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "b520fd2c-9551-4bc1-8e36-ea27e2a526f6",
    "role": "Java Developer",
    "company": "IntaPeople",
    "rate": "£40k - 45k per annum",
    "description": "Java Developer Swansea We're helping scale the development team for a company based near Swansea and on the lookout for a talented Software Developer. Cutting through all the normal advert nonsense, we're really open to seeing a range of applications from a range of developers who are looking to make a change. The role is Java focused but don't worry if you don't have everything we've listed, there's a lot of learning involved working with things like API/Micro-services Architecture, REST/SOAP, and Kubernetes so we're more-so looking for someone whos passionate about development and keen to...  more ->",
    "link": "http://www.jobserve.com/HC3G3",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "f296fccd-dc9d-4e6b-9217-0a2be0143229",
    "role": "Java Developer AWS",
    "company": "Version1",
    "rate": "Negotiable + profit share, medical and pensoon",
    "description": "Java Developer - AWS London, UK Full-time Company Description We pledge \"to prove IT can make a real difference to our customer's businesses\". We work hard to ensure we understand what our customers need from their technology solutions and then we deliver. We are an award-winning company who provide world class customer service; we think big and we hire great people. Version 1 is more than just another IT services company - we are leaders in implementing and supporting Oracle, Microsoft and AWS technologies. Invest in us and we'll invest in you; if you are driven, committed and up for a...  more ->",
    "link": "http://www.jobserve.com/HBjG1",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "0fd3dadd-774f-49b2-a20e-dfdf5263a28b",
    "role": "Java Developer - Java, Scala, Microservices, TDD",
    "company": "Oliver Bernard",
    "rate": "£70k - £80k per annum + Excellent benefits",
    "description": "Java Developer - Java, Scala, Microservices, TDD A rapidly growing video streaming company are looking for a Java Developer to join their team working on highly complex applications. The company are ideally looking for someone with a Polyglot mindset, at the moment the role is nearly all Java but there is also a Scala project ready to go, in the future they'd like to see someone with the mindset of using the best tools for the jobs. All in all a good opportunity for a Java Developer to learn new technologies, work within a team with a very flat structure and also a chance to work on a number...  more ->",
    "link": "http://www.jobserve.com/HDHzh",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "2c0ce0e4-5aaf-4546-888b-5e52e4762828",
    "role": "Java Developer (Some remote working)",
    "company": "IT Recruitment Solutions",
    "rate": "£30k - £40k",
    "description": "Java Developer required by a digital business who lead the way in their industry and are pushing into international markets. My client is a small but successful business who have been operating in their industry for well over a decade. You will be joining a tech team of 7 and will work closely with the Senior Java Developer, learning from him daily. You will need to have gained some commercial experience in a Java Developer capacity however, we are open to both junior developers and mid-level developers for this role. Here is a snapshot of the tech stack you will be working with: Java Spring...  more ->",
    "link": "http://www.jobserve.com/HCK5m",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "61216ef2-2112-4b64-ac10-88195b6a7610",
    "role": "Java TDD Senior Developer",
    "company": "Henley Computer Services",
    "rate": "£50K-£60K + benefits",
    "description": "Java TDD Senior Developer Our client is looking for a Java Senior Developer to work on a client facing web application and a Back Office web application. Work on the client-facing system is mainly as a result of client requests, while the main thrust of the Back Office system is to replace the Legacy DOS-based system. Key Objectives Software development and maintenance to meet user requirements. Working within the team, typically developing in a pair or individually depending on the nature of individual development tasks. Gather requirements from the business, from the Head of IT and other...  more ->",
    "link": "http://www.jobserve.com/G9iXp",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "26456a46-bb0a-49ee-912e-02f44b6d86fa",
    "role": "Java Developer/Software Engineer/Programmer-C/C++, Telecomms/Network",
    "company": "Genesis Techincal Systems Ltd",
    "rate": "Up to £50k",
    "description": "Java Developer/Software Engineer/Programmer-C/C++, Telecomms/Network Genesis Technical Systems provides technology solutions for delivering faster broadband further, over existing carrier networks. We believe that anything is possible, and with persistence, a bit of creative thought and lots of innovation, we can indeed deliver faster broadband, further for the global telecommunications industry. Currently we are offering an exciting opportunity for the right person to join our talented engineering team, based in Coventry, as a Software Engineer on a salary up to £50,000 depending on your...  more ->",
    "link": "http://www.jobserve.com/HBAfA",
    "posted": "20190620",
    "relevance": 1
},{
    "job_id": "bb68707e-0b2e-4d1e-bf4b-f188d46b849d",
    "role": "Java Technical Lead",
    "company": "Henley Computer Services",
    "rate": "Up to £80k + benefits",
    "description": "Java Technical Lead Our client is looking for a Technical Lead to work on two main projects: A client facing web application and a Back Office web application. Work on the client-facing system is mainly as a result of client requests, while the main thrust of the Back Office system is to replace the Legacy DOS-based system. Key Objectives Software development and maintenance to meet user requirements. Working within the team, typically leading development in a pair or individually depending on the nature of individual development tasks. Mentoring the Senior Developers to progress their skills...  more ->",
    "link": "http://www.jobserve.com/G38on",
    "posted": "20190620",
    "relevance": 1
},{
    "job_id": "293d1512-f1a2-4892-b4a1-6fcd8994c7fa",
    "role": "Java Developer",
    "company": "Spring Technology",
    "rate": "£40k - £50k per annum",
    "description": "Java Developer Milton Keynes £40,000 - £50,000 per annum + benefits Java | OOP | Eclipse | Hibernate | Junit | SQL | JMS | Spring Technology is currently working in partnership with a leading Product Provider to recruit a Java Developer based in Milton Keynes. As the successful individual you'll have a strong background of Java Development, with experience of working on large scale projects. You'll need to have good experience working with databases with the ability to deliver complex queries. You will also be involved in mentoring and guiding junior developers - taking ownership of...  more ->",
    "link": "http://www.jobserve.com/HDL3d",
    "posted": "20190627",
    "relevance": 1
},{
    "job_id": "f51bc4d6-f159-4d8e-9a62-70318f525157",
    "role": "Java Developer",
    "company": "Sanderson Government & Defence",
    "rate": "£35k - £55k per annum + Excellent benefits",
    "description": "Java Developer Working for a highly innovative software developer/integrator in Leeds centre you will be part of a team of 20 developers and architects working on some of the countries most interesting and technologically important projects. Due to this organisations market, you will find yourself working on a number of different projects over the course of your career, ranging from commercial migrations and builds to military assets. The organisation is set to double over the course of the next 5 years and as such there is more than adequate room for the right person to work their way up the...  more ->",
    "link": "http://www.jobserve.com/HC8qM",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "9d54e427-4df4-4184-aba6-32f75b764576",
    "role": "Java Developer - Investment Banking",
    "company": "J & C Associates Ltd",
    "rate": "Health - Bonus - Pension",
    "description": "Java Developer - Investment Banking We are seeking bright and talented individuals with strong Java development skills to work on an exciting project for a major investment bank! You will be working in a leading role on a major project for the bank and this particular project will give you exposure to a range of exciting, new technologies across different asset classes! The project you will initially be working on will be in the interest rate IT team where you will be helping to implement brand new, state of the art trading system. Your day to day tasks will be varied but will cover the...  more ->",
    "link": "http://www.jobserve.com/GJ1VH",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "f4c0b41e-2d10-4a25-a2f7-72cea64bb5bc",
    "role": "Java Developer",
    "company": "Incisive Ltd",
    "rate": "£50k - £80k + Bonus",
    "description": "Java Developer Our client, a technology services company that designs and develops software solutions for ambitious organisations are currently looking for a number of Java Developers who are bright, well-educated with a Bachelor's degree/Master's degree in Computer Science, Computer Engineering or related field to join their team in London. They are building a new team to work on an exciting programme of work with one of their clients: who are a very prestigious global investment bank based in London and New York. This a fantastic programme to be involved with as it will provide exposure to...  more ->",
    "link": "http://www.jobserve.com/HCQOL",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "54f76d5a-d75f-410b-bf62-510c31a4e05a",
    "role": "Java Developer - J2EE - Milton Keynes",
    "company": "Eurobase People",
    "rate": "£35k - £40k",
    "description": "Java Developer - J2EE - Milton Keynes A Security Cleared Java Developer is required to be based in the Milton Keynes area. Our client is looking for an experienced Java Developer to work within their current projects, you will be required to have experience of developing applications across various projects. Responsibilities Perform requirement analysis to create low-level design for individual modules Perform Java Unit tests and test developed changes in integration Implement J2EE modules, based on high-level designs Skills Familiar with UML modelling Knowledgeable with iterative development...  more ->",
    "link": "http://www.jobserve.com/HC9Bd",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "a468b19d-5cd4-4ce7-be7a-c4956d2e41a5",
    "role": "Java Engineer, Front Office",
    "company": "Morgan McKinley UK",
    "rate": "£60k - £80k per annum",
    "description": "Java Engineer, Front Office £60,000-80,000/year If you're an experienced Java developer with strong experience building microservices-based systems, this position will interest you. It sits within an exciting Front Office trading project of a leading Investment Banking client of mine. You will: Take ownership and responsibility for the full development life cycle Experience in the end-to-end design, development and support of financial markets systems Work in a dynamic Front Office Trading team Have familiarity or experience in micro-services and container technologies Skills & Experience:...  more ->",
    "link": "http://www.jobserve.com/HBOdD",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "8676e579-2aa2-4811-a62c-ab2f1cfa9434",
    "role": "Java Development Lead",
    "company": "83Zero Ltd",
    "rate": "£50k - £70k + Car Allowance + Bonus + Benefits",
    "description": "Java Development Lead - Reading - Permanent £50,000 - £70,000 (D.O.E) Benefits - £5,300 Car Allowance, 10% Bonus, Private Medical Insurance, Income Protection etc. This is a fantastic opportunity for a Java Development Lead to join our client, a leading global digital transformation consultancy. This is a fantastic opportunity to be a key player within their Software Development Business Unit within the Global Systems Practice, working with top-tier clients across the UK. The Role: Provide Technical Leadership for the Team (6 Developers & Testers) throughout all phases of development Produce...  more ->",
    "link": "http://www.jobserve.com/HC7xC",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "047673fc-9b3e-4793-a21c-9265b11eaff0",
    "role": "Java Developer",
    "company": "83Zero Ltd",
    "rate": "£40k - £80k + Benefits Package",
    "description": "Java Developer - London - Permanent Salary - £40,000 - £80,000 (D.O.E) Per Annum + Bonus + Benefits My client, a leading global digital transformation consultancy, are currently looking for multiple Java Developers to create solutions for client and Server Side software, on some of the most cutting edge digital and cloud-based architectures in development today. The Role: You'll be responsible for the specification, development, unit testing and implementation of complex multi-tier applications. Enhance existing applications to meet changes in need and requirement. Provide technical support...  more ->",
    "link": "http://www.jobserve.com/HC7xA",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "d2e5b7d3-edd8-41b4-8dbb-96f454d21a72",
    "role": "Java Developer",
    "company": "Spencer Scott",
    "rate": "Up to £75k + benefits",
    "description": "Java Developer Our client are a technology company who are currently at the forefront of London's tech scene, and they're looking to hire a number of talented Java Developers to join their team on a permanent basis. These guys build high-traffic, high transactional software used by millions of satisfied customers on a Global basis, with affiliations to some famous names within the Online world! The Java Developers will come with a modern technology stack and they'll focus on building software with code quality in mind. Ideally, the successful Java Developers will have worked with Java 8 (or...  more ->",
    "link": "http://www.jobserve.com/HDHIb",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "1b35f4e8-d248-4da6-9af3-5b2b812cce52",
    "role": "Java Developer - £60,000 - Java 8, Microservices, TDD",
    "company": "Oliver Bernard",
    "rate": "£60k per annum",
    "description": "Java Developer - £60,000 - Java 8, Microservices, TDD A multi-skilled development team are looking to add another Java Developer to their squad as they aim to radically change their working practices to realise their ambition of being the market leader in their field. The successful Java Developer would need to have: Strong Java 8 experience Experience with Microservices Ability to support live products in a DevOps environment Understanding of SOA and ORM technologies The successful Java Developer will be responsible for: Writing high quality code including tests. Collaborate with the team to...  more ->",
    "link": "http://www.jobserve.com/HDL1S",
    "posted": "20190627",
    "relevance": 1
},{
    "job_id": "c8e591ce-0f59-4a46-b75f-ffc5178d9612",
    "role": "Java Developer - £60,000 - Java 8, SQL, AWS",
    "company": "Oliver Bernard",
    "rate": "£55k - £60k per annum",
    "description": "Java Developer - £60,000 - Java 8, SQL, AWS Due to the continued success and growth of the company, my client based in Central Manchester are looking to add a Java Developer. The role is with an award-winning software house who provide analytical SaaS systems aimed to deliver savings to their customers. The successful Java Developer would need to have: Strong Java 8 experience Experience using SQL and AWS Testing tool experience The successful Java Developer would be rewarded with: Strong salary and rewards package Personal development budget Recognition events If you are interested in...  more ->",
    "link": "http://www.jobserve.com/HDL1P",
    "posted": "20190627",
    "relevance": 1
},{
    "job_id": "b6887e9c-52b5-4e62-9b09-6cd073fe6a78",
    "role": "Java Developer - Energy",
    "company": "Oliver Bernard",
    "rate": "£65k - £80k per annum + bonus",
    "description": "Java Developer Senior Software Engineer - Energy Best-in-class Java Developer required to join the highly respected cross-functional engineering team behind an influential young Energy business. Java Developer - Skills Required : - Java 8 - Spark - NoSQL - ElasticSearch - AWS - Agile - TDD Java Developer As an experienced Java Developer you will be expected to present solid OO Java Development skills, along with a varied background working with a range of NoSQL, Cloud or Big Data technologies. You're focus will be on Java Server Side Development, dealing with distributed systems, Scalability...  more ->",
    "link": "http://www.jobserve.com/HDGcu",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "92d38c7c-0cb7-4416-8883-87faa5357d77",
    "role": "Java Developer - Concurrency, Kafka, DevOps",
    "company": "Oliver Bernard",
    "rate": "£55k - £70k per annum + Excellent bonus & benefits",
    "description": "Java Developer, Senior Software Engineer | Concurrency, DevOps, Java 8 | Gaming (Sponsorship Available) Java Developer | Prominent in the world of social Gaming, this global brand are currently on the lookout for a skilled and highly Agile Java Developer to join their award winning engineering team in their industry fitting central London office space. Required Skills : Senior Java Developer - Java 8 - Databases/NoSQL - Kafka - Agile, TDD - DevOps, Continuous Integration, CD As an experienced Java Developer you will be focusing your efforts on performance, reliability and scalability, using...  more ->",
    "link": "http://www.jobserve.com/HDGb9",
    "posted": "20190626",
    "relevance": 1
},{
    "job_id": "db2ac45a-e8d8-4ae0-9c70-d9f2348fab0a",
    "role": "Java Developer - Java, XP, TDD, REST",
    "company": "Oliver Bernard",
    "rate": "£40k - £60k per annum + Excellent benefits",
    "description": "Java Developer - Java, XP, TDD, REST Innovative Agile company seek a number of Java Developers to work across a range of new projects. This company have a very high standard of Development and this genuinely offers the chance to work with one of the best teams in the City. Although most of the work is in Java, they are keen on Developers who are of the polyglot mind-set of using the best tools for the job. They have a number of other projects in the pipeline involving the use of Scala, so a real good chance to work with new tools and technologies. In addition the company pay for Developers to...  more ->",
    "link": "http://www.jobserve.com/HC9Cy",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "bc122644-5c4f-4f2d-ac7c-654b2fb68515",
    "role": "Java Developer - E-commerce Consultancy",
    "company": "Oliver Bernard",
    "rate": "£40k - £70k per annum",
    "description": "Java Developer - E-commerce Consultancy Would you like the chance to work for a company who is revolutionizing the way we shop online? A new global eCommerce consultancy is looking for several Java Developers to join their engineering team. You will be part of the team responsible for shaping and building a modern digital and eCommerce platform for a prestigious retailer. Technologies -. Core JAVA and object-oriented programming (Java 7+). Core JEE programming, including JSP, Servlet, JAX-RS, JPA, JDBC, JMS. Extensive experience developing high-volume, performant, secure, scalable and...  more ->",
    "link": "http://www.jobserve.com/HC4RV",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "58451b54-8d7b-4f00-aa40-c921e57bf591",
    "role": "Java Developer - Financial Services",
    "company": "Oliver Bernard",
    "rate": "£55k - £75k per annum + Bonus",
    "description": "Java Developer - Java, JMS, Lucene, TDD - Finance Java Developer | Experienced Java Developer required to join a global asset finance business in their London City HQ. Joining this unique financial organisation based in the heart of London, servicing thousands of people worldwide, the Senior Java Developer will be diving into large scale greenfield projects from day one, driving delivery and bolstering an existing team of skilled Agile Developers and business professionals - offering your expert technical knowledge and business savvy approach to bridge the gap between the two. Technically...  more ->",
    "link": "http://www.jobserve.com/HC3K7",
    "posted": "20190624",
    "relevance": 1
},{
    "job_id": "2cb50f0b-52b1-4da5-bef5-132487ea47b6",
    "role": "Java Developer - Spring, Angular4/5, Blockchain, Cryptocurrency",
    "company": "Oliver Bernard",
    "rate": "£70k - £80k per annum + benefits",
    "description": "Java Developer - Spring, Angular4/5, Blockchain, Cryptocurrency A specialist tech first company working within Blockchain and Cryptocurrency seek a number of Full Stack Java Developers to join a rapidly growing team. You'll be working on a brand new financial platform within a team that has a very flat structure and collaborative environment. The type of team where everyone makes decisions together, deliver quality software, use the best tools for the job and adhere to best practices. Each employee is allocated a training budget, so there is a chance to attend courses/gain certifications, the...  more ->",
    "link": "http://www.jobserve.com/HCoTg",
    "posted": "20190622",
    "relevance": 1
},{
    "job_id": "f750c371-afcd-4847-989e-34bc907cc459",
    "role": "Java Software Engineer",
    "company": "Lawrence Harvey",
    "rate": "£45k - £55k per annum",
    "description": "Java Back End Developer sought for one of the coolest business in Bristol. You'll be working on a range of Java projects including for software for satellites mapping the Northern Lights. We seek talented Java Developers especially those within an interest in coding in Python or C++. This is for a business that I love hiring for, Lawrence Harvey have made a number of hires with them over the last three years, all of whom are still with the business. If you're a Java software engineer looking for complex and challenging project work this should be the number one option in your job hunt. Java...  more ->",
    "link": "http://www.jobserve.com/HC87f",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "f685b4e5-6ccb-43ac-8546-20dbe348ae6d",
    "role": "Java Developer - AWS Spring Boot",
    "company": "FinTech Source",
    "rate": "£70k - 75k per annum, Benefits: + 12% Bonus +",
    "description": "Java Developer - Java EE AWS Spring Boot Cloud, Microservices, REST API Learn Scala to 75K + 12% Bonus Our client a world leader in Analytical/Big Data Solutions currently seek a Java Developer/Java Engineer to work on designing, developing, deploying and support of client implementations of their Cloud Platform. Keywords - Java Developer, Java Software Engineer, Java Architect, Lead Java Developer, Snr Java Developer, Software Developer, DevOps Engineer, Java DevOps Key Skills Java - J EE Spring Boot NoSQL Databases AWS and Containers - Docker/Kubernetes JavaScript/Angular/GoJs, SPA...  more ->",
    "link": "http://www.jobserve.com/HC8P7",
    "posted": "20190625",
    "relevance": 1
},{
    "job_id": "b53ab026-ba0c-4e97-ba97-a57a9992d480",
    "role": "Java Developer - Java 11, Microservices, Spring Boot",
    "company": "Michael Page Technology",
    "rate": "£80k - £90k per annum + Plus bonus, benefits",
    "description": "Java Developer Java Development within a successful business based in the City. Working on business critical applications using Java 11, Microservices, Spring Boot building RESTful services. Client Details Java Developer Highly successful, city based financial services business. Description Java Developer Development role, reporting to the team lead, for the creation, maintenance and enhancement of services that support the business critical applications. Profile Substantial experience as a Solution Developer with good technical expertise in core Java development and RESTful services Strong...  more ->",
    "link": "http://www.jobserve.com/HCndz",
    "posted": "20190622",
    "relevance": 1
},{
    "job_id": "7ecf1707-a863-426c-804a-72f25995252c",
    "role": "Java Developer - Spring Boot",
    "company": "Michael Page Technology",
    "rate": "£30k - £40k per annum",
    "description": "Java Developer You will have responsibility for the design, creation, testing and documenting of new and amended functionality of an application which takes data from AI algorithms. Responsible for working alongsie maintenance and support teams, either directly to users of the applications or to service delivery functions. Client Details Java Developer Our client are a world leader in technology. We are looking to grow our Client's team with a Front End Development Lead/Senior Software Engineer who will be responsible for the development of a product which utilises the latest AI based...  more ->",
    "link": "http://www.jobserve.com/HCncn",
    "posted": "20190622",
    "relevance": 1
},{
    "job_id": "aa9dc32b-65d7-4ce0-bc0c-06a03ff3d21c",
    "role": "Java Developer",
    "company": "Sanderson Government & Defence",
    "rate": "£40k - £75k per annum",
    "description": "Java Developer Do you want to work in National Security? Do you want to work with cutting edge technology? Is the opportunity to learn about new and emerging technologies important to you? Are we looking for you? We are looking for Java Developers to join our growing Software Delivery team. You will be working on exciting projects using modern and cutting-edge technologies to deliver high quality solutions, including in Agile and DevOps delivery. You will be involved in all aspects of the development life cycle and often work directly with the customer. You might be working as an individual...  more ->",
    "link": "http://www.jobserve.com/HCjge",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "963c9728-c51e-4af7-8fe0-36db020f08e6",
    "role": "Java Developer - Award-winning Company - Wokingham - £70K",
    "company": "Austin Fraser Ltd",
    "rate": "£65k - £70k per annum + Bonus",
    "description": "Java Developer - £70K - Wokingham Austin Fraser has an exciting opportunity for a Java Developer with a few years of commercial experience to take a step up and work in an SME developing some groundbreaking software in the Healthcare industry. The business is a longstanding client of Austin Fraser and has grown sensationally in the past 8 years. They have won multiple healthcare software awards plus business awards for their 100% privately owned growth. The CEO still codes and is around the office every day. Ture to their growth plans we are looking for a solid developer to come and join this...  more ->",
    "link": "http://www.jobserve.com/HCizp",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "4fb67d97-b522-4a7d-ad25-2122bc8c25cb",
    "role": "Java Developer - Guildford - £85K",
    "company": "Austin Fraser Ltd",
    "rate": "£76k - £85k per annum + Bonus + Benefits",
    "description": "Java Developer - Guildford - £85K Austin Fraser has the pleasure of appointing an experienced Java Developer for a key client who is at the forefront of payment software solutions and have some exciting growth plans to meet the business demands within Europe and globally. This is a fantastic opportunity for you to be part of a small growing team who are part of a global development team. The business is looking to scale up in the UK creating a centre of excellence for its development function. Naturally, this will enable you to have opportunities within a leadership capacity. This role will...  more ->",
    "link": "http://www.jobserve.com/HCisq",
    "posted": "20190621",
    "relevance": 1
},{
    "job_id": "afa63801-d1f9-450e-b6e4-28927949d525",
    "role": "Java Developer Software Engineer Finance Trading AWS London",
    "company": "Joseph Harry Ltd",
    "rate": "£80k - £100k per annum + 20% Bonus + 10% Pension",
    "description": "Java Developer (J2EE Programmer Software Engineer Amazon Web Services AWS Finance Trading PostgreSQL MySQL gRPC Aurora Dropwizard Microservices) required by our asset management client in London. You MUST have the following: Advanced experience as a Java Developer/Programmer/Software Engineer, including microservices Java service to service API experience PostgreSQL or MySQL Experience working with Amazon Web Services (AWS) OR financial trading data The following is DESIRABLE, not essential: gRPC Amazon Aurora Dropwizard Role: Java Developer (J2EE Programmer Software Engineer Amazon Web...  more ->",
    "link": "http://www.jobserve.com/HDHrG",
    "posted": "20190626",
    "relevance": 1
}]